import { NextSeo } from 'next-seo';
import Link from "next/link";

export default function About() {
    const title = "احنا مين؟ — المكتبة القومية"
    const desc = "في الصفحة دي هتعرف احنا مبن وايه هدفنا ومصادرنا"

    return (
        <>
            <NextSeo
                title={title}
                description={desc}
                openGraph={{
                    title: `${title}`,
                    description: `${desc}`,
                    type: 'website',
                }}
                additionalMetaTags={[
                    {
                        itemProp: 'name',
                        content: { title }
                    },
                    {
                        itemProp: 'description',
                        content: { desc }
                    },
                ]}
            />
            <h1>احنا مين؟</h1>
            <div className="mt-4">
                <p>المكتبة القومية هي أحد أبرز إنجازات مشروع الوعي القومي، وهي مكتبة الكترونية ومنصة شاملة ومتكاملة بتحتوي على مجموعة واسعة من الكتب والمواد اللي بتغطي مختلف المجالات التاريخية والسياسية والثقافية والفنية والاقتصادية والاجتماعية وكل كا له علاقة بالفكر القومي المصري.</p>
                <br />
                <p>فبتضم المكتبة القومية تشكيلة كبيرة من الكتب التاريخية اللي بتسلط الضوء على تاريخ مصر وحضارتها على مر الحقب الزمنية. وبتشمل كذلك مجموعة من الكتب السياسية اللي تتناول القضايا المصرية والتحولات السياسية في البلاد قديمًا وحديًا.</p>
                <br />
                <h2>المحتوى المكتوب</h2>
                <br />
                <p>تشتمل المكتبة على مجموعة كبيرة من الكتب الثقافية والفنية اللي بتغطي كم كبير مختلف جوانب الثقافة المصرية والعادات والتقاليد والتراث المادي والمعنوى والأدب سواء قديمًا أو حديثًا، بما يشمل الأدب والشعر والفلسفة والفنون التشكيلية والأزياء والأكل وغيرهم الكتير.</p>
                <br />
                <p>بالإضافة إلى المواد المكتوبة، بتحتوي المكتبة القومية على مجموعة هامة من المقالات والأبحاث في مجال المصريات والتاريخ والجينات الخاصة بالشعب المصري وأصوله.</p>
                <br />
                <p>تم توثيق المقالات والأبحاث دي بشكل دقيق وموثوق وشامل عشان تبقى مرجع مهم للشباب الباحثين والمهتمين في كل المجالات.</p>
                <br />
                <h2>المحتوى المرئي</h2>
                <br />
                <p>غير ده بتوفر المكتبة القومية مجموعة من الأفلام الوثائقية والسير الذاتية الهامة التي تغطي تاريخ الأمة المصرية عبر مختلف الحقب الزمنية وشخصيات مصرية واسعة ومتنوعة من كل الحقب التاريخية أثرت وساهمت بشكل ايجابي وعظيم في تاريخ الدولة المصرية.</p>
                <br />
                <p>بتسلط الأفلام الوثائقية الضوء على أحداث وشخصيات هامة، وبتقدم رؤية شاملة للتطورات السياسية والاجتماعية والثقافية والتحولات الجذرية اللي أثرت على مسار الحضارة الكصرية وتاريخها.</p>
                <br />
                <p>تأسست المكتبة القومية بواسطة مجموعة من الشباب المصريين المتخصصين في مجالات متنوعة ذات صلة بالتاريخ والآثار والعلوم المختلفة.</p>
                <br />
                <h2>المؤسسين</h2>
                <br />
                <p>هدفهم الرئيسي هو تعزيز الوعي القومي المصري وتعميق الفهم الشامل لتاريخ البلاد وثقافتها وهويتها وبنسعى إن المكتبة القومية تصبح أحد أهم المصلدر والمراجع للمعلومات عن الفكر القومي المصري، وبوابة رئيسية لكل من يهتم بيه والموضوعات اللي على صلة بيه.</p>
            </div>
        </>
    )
}